In [19]:
import pandas as pd

In [20]:
# File to Load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [21]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [22]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [23]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [35]:
# Calculate the total number of schools
total_schools = school_data["School ID"].count()
total_schools

39170

In [32]:
#Calculate the total number of students
total_students = student_data["Student ID"]()

39170

In [36]:
# Calculate sum of budgets
total_budget = school_data["budget"].sum()
total_budget

24649428

In [37]:
#Calculate average math scores
math_average = student_data["math_score"].mean()
math_average

78.98537145774827

In [38]:
#Calculate average reading scores
read_average = student_data["reading_score"].mean()
read_average

81.87784018381414

In [41]:
# math_pass = number of students that have a math score >= 70
math_pass = 0
if student_data["math_score"].value >= 70:
    math_pass += 1
math_pass

# read_pass = number of students that have a reading score >= 70

# pass = number of students that have a math AND reading score >= 70

# per_math_pass = (math_pass/total_students) * 100

# per_read_pass = (read_pass/total_students) * 100

# per_pass = (pass/total_students) * 100

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().